foxval/esp-idf/components/soc/esp32c/include/soc/efuse_reg.h
#define EFUSE_RD_KEY5_DATA5_REG          (DR_REG_EFUSE_BASE + 0x150)
/* EFUSE_KEY5_DATA5 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY5_DATA5  0xFFFFFFFF
#define EFUSE_KEY5_DATA5_M  ((EFUSE_KEY5_DATA5_V)<<(EFUSE_KEY5_DATA5_S))
#define EFUSE_KEY5_DATA5_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA5_S  0

#define EFUSE_RD_KEY5_DATA6_REG          (DR_REG_EFUSE_BASE + 0x154)
/* EFUSE_KEY5_DATA6 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY5_DATA6  0xFFFFFFFF
#define EFUSE_KEY5_DATA6_M  ((EFUSE_KEY5_DATA6_V)<<(EFUSE_KEY5_DATA6_S))
#define EFUSE_KEY5_DATA6_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA6_S  0

#define EFUSE_RD_KEY5_DATA7_REG          (DR_REG_EFUSE_BASE + 0x158)
/* EFUSE_KEY5_DATA7 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY5_DATA7  0xFFFFFFFF
#define EFUSE_KEY5_DATA7_M  ((EFUSE_KEY5_DATA7_V)<<(EFUSE_KEY5_DATA7_S))
#define EFUSE_KEY5_DATA7_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA7_S  0

#define EFUSE_RD_KEY6_DATA0_REG          (DR_REG_EFUSE_BASE + 0x15c)
/* EFUSE_KEY6_DATA0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY6_DATA0  0xFFFFFFFF
#define EFUSE_KEY6_DATA0_M  ((EFUSE_KEY6_DATA0_V)<<(EFUSE_KEY6_DATA0_S))
#define EFUSE_KEY6_DATA0_V  0xFFFFFFFF
#define EFUSE_KEY6_DATA0_S  0

#define EFUSE_RD_KEY6_DATA1_REG          (DR_REG_EFUSE_BASE + 0x160)
/* EFUSE_KEY6_DATA1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY6_DATA1  0xFFFFFFFF
#define EFUSE_KEY6_DATA1_M  ((EFUSE_KEY6_DATA1_V)<<(EFUSE_KEY6_DATA1_S))
#define EFUSE_KEY6_DATA1_V  0xFFFFFFFF
#define EFUSE_KEY6_DATA1_S  0

#define EFUSE_RD_KEY6_DATA2_REG          (DR_REG_EFUSE_BASE + 0x164)
/* EFUSE_KEY6_DATA2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY6_DATA2  0xFFFFFFFF
#define EFUSE_KEY6_DATA2_M  ((EFUSE_KEY6_DATA2_V)<<(EFUSE_KEY6_DATA2_S))
#define EFUSE_KEY6_DATA2_V  0xFFFFFFFF
#define EFUSE_KEY6_DATA2_S  0

#define EFUSE_RD_KEY6_DATA3_REG          (DR_REG_EFUSE_BASE + 0x168)
/* EFUSE_KEY6_DATA3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY6_DATA3  0xFFFFFFFF
#define EFUSE_KEY6_DATA3_M  ((EFUSE_KEY6_DATA3_V)<<(EFUSE_KEY6_DATA3_S))
#define EFUSE_KEY6_DATA3_V  0xFFFFFFFF
#define EFUSE_KEY6_DATA3_S  0

#define EFUSE_RD_KEY6_DATA4_REG          (DR_REG_EFUSE_BASE + 0x16c)
/* EFUSE_KEY6_DATA4 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY6_DATA4  0xFFFFFFFF
#define EFUSE_KEY6_DATA4_M  ((EFUSE_KEY6_DATA4_V)<<(EFUSE_KEY6_DATA4_S))
#define EFUSE_KEY6_DATA4_V  0xFFFFFFFF
#define EFUSE_KEY6_DATA4_S  0

#define EFUSE_RD_KEY6_DATA5_REG          (DR_REG_EFUSE_BASE + 0x170)
/* EFUSE_KEY6_DATA5 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY6_DATA5  0xFFFFFFFF
#define EFUSE_KEY6_DATA5_M  ((EFUSE_KEY6_DATA5_V)<<(EFUSE_KEY6_DATA5_S))
#define EFUSE_KEY6_DATA5_V  0xFFFFFFFF
#define EFUSE_KEY6_DATA5_S  0

#define EFUSE_RD_KEY6_DATA6_REG          (DR_REG_EFUSE_BASE + 0x174)
/* EFUSE_KEY6_DATA6 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY6_DATA6  0xFFFFFFFF
#define EFUSE_KEY6_DATA6_M  ((EFUSE_KEY6_DATA6_V)<<(EFUSE_KEY6_DATA6_S))
#define EFUSE_KEY6_DATA6_V  0xFFFFFFFF
#define EFUSE_KEY6_DATA6_S  0

#define EFUSE_RD_KEY6_DATA7_REG          (DR_REG_EFUSE_BASE + 0x178)
/* EFUSE_KEY6_DATA7 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define EFUSE_KEY6_DATA7  0xFFFFFFFF
#define EFUSE_KEY6_DATA7_M  ((EFUSE_KEY6_DATA7_V)<<(EFUSE_KEY6_DATA7_S))
#define EFUSE_KEY6_DATA7_V  0xFFFFFFFF
#define EFUSE_KEY6_DATA7_S  0

#define EFUSE_RD_REPEAT_ERR0_REG          (DR_REG_EFUSE_BASE + 0x17c)
/* EFUSE_RD_SDIO_DREFH_ERR : RO ;bitpos:[31:30] ;default: 2'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_DREFH_ERR  0x00000003
#define EFUSE_RD_SDIO_DREFH_ERR_M  ((EFUSE_RD_SDIO_DREFH_ERR_V)<<(EFUSE_RD_SDIO_DREFH_ERR_S))
#define EFUSE_RD_SDIO_DREFH_ERR_V  0x3
#define EFUSE_RD_SDIO_DREFH_ERR_S  30
/* EFUSE_RD_SDIO_MODECURLIM_ERR : RO ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_MODECURLIM_ERR  (BIT(29))
#define EFUSE_RD_SDIO_MODECURLIM_ERR_M  (BIT(29))
#define EFUSE_RD_SDIO_MODECURLIM_ERR_V  0x1
#define EFUSE_RD_SDIO_MODECURLIM_ERR_S  29
/* EFUSE_RD_USB_DRES_ERR : RO ;bitpos:[28:25] ;default: 4'b0 ; */
/*description: */
#define EFUSE_RD_USB_DRES_ERR  0x0000000F
#define EFUSE_RD_USB_DRES_ERR_M  ((EFUSE_RD_USB_DRES_ERR_V)<<(EFUSE_RD_USB_DRES_ERR_S))
#define EFUSE_RD_USB_DRES_ERR_V  0xF
#define EFUSE_RD_USB_DRES_ERR_S  25
/* EFUSE_RD_USB_EXCHG_PINS_ERR : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_USB_EXCHG_PINS_ERR  (BIT(24))
#define EFUSE_RD_USB_EXCHG_PINS_ERR_M  (BIT(24))
#define EFUSE_RD_USB_EXCHG_PINS_ERR_V  0x1
#define EFUSE_RD_USB_EXCHG_PINS_ERR_S  24
/* EFUSE_RD_USB_DREFL_ERR : RO ;bitpos:[23:22] ;default: 2'b0 ; */
/*description: */
#define EFUSE_RD_USB_DREFL_ERR  0x00000003
#define EFUSE_RD_USB_DREFL_ERR_M  ((EFUSE_RD_USB_DREFL_ERR_V)<<(EFUSE_RD_USB_DREFL_ERR_S))
#define EFUSE_RD_USB_DREFL_ERR_V  0x3
#define EFUSE_RD_USB_DREFL_ERR_S  22
/* EFUSE_RD_USB_DREFH_ERR : RO ;bitpos:[21:20] ;default: 2'b0 ; */
/*description: */
#define EFUSE_RD_USB_DREFH_ERR  0x00000003
#define EFUSE_RD_USB_DREFH_ERR_M  ((EFUSE_RD_USB_DREFH_ERR_V)<<(EFUSE_RD_USB_DREFH_ERR_S))
#define EFUSE_RD_USB_DREFH_ERR_V  0x3
#define EFUSE_RD_USB_DREFH_ERR_S  20
/* EFUSE_RD_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR  (BIT(19))
#define EFUSE_RD_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_M  (BIT(19))
#define EFUSE_RD_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_V  0x1
#define EFUSE_RD_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_S  19
/* EFUSE_RD_HARD_DIS_JTAG_ERR : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_HARD_DIS_JTAG_ERR  (BIT(18))
#define EFUSE_RD_HARD_DIS_JTAG_ERR_M  (BIT(18))
#define EFUSE_RD_HARD_DIS_JTAG_ERR_V  0x1
#define EFUSE_RD_HARD_DIS_JTAG_ERR_S  18
/* EFUSE_RD_SOFT_DIS_JTAG_ERR : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SOFT_DIS_JTAG_ERR  (BIT(17))
#define EFUSE_RD_SOFT_DIS_JTAG_ERR_M  (BIT(17))
#define EFUSE_RD_SOFT_DIS_JTAG_ERR_V  0x1
#define EFUSE_RD_SOFT_DIS_JTAG_ERR_S  17
/* EFUSE_RD_DIS_EFUSE_ATE_WR_ERR : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_EFUSE_ATE_WR_ERR  (BIT(16))
#define EFUSE_RD_DIS_EFUSE_ATE_WR_ERR_M  (BIT(16))
#define EFUSE_RD_DIS_EFUSE_ATE_WR_ERR_V  0x1
#define EFUSE_RD_DIS_EFUSE_ATE_WR_ERR_S  16
/* EFUSE_RD_DIS_SDIO_ACCESS_ERR : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_SDIO_ACCESS_ERR  (BIT(15))
#define EFUSE_RD_DIS_SDIO_ACCESS_ERR_M  (BIT(15))
#define EFUSE_RD_DIS_SDIO_ACCESS_ERR_V  0x1
#define EFUSE_RD_DIS_SDIO_ACCESS_ERR_S  15
/* EFUSE_RD_DIS_CAN_ERR : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_CAN_ERR  (BIT(14))
#define EFUSE_RD_DIS_CAN_ERR_M  (BIT(14))
#define EFUSE_RD_DIS_CAN_ERR_V  0x1
#define EFUSE_RD_DIS_CAN_ERR_S  14
/* EFUSE_RD_DIS_USB_ERR : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_USB_ERR  (BIT(13))
#define EFUSE_RD_DIS_USB_ERR_M  (BIT(13))
#define EFUSE_RD_DIS_USB_ERR_V  0x1
#define EFUSE_RD_DIS_USB_ERR_S  13
/* EFUSE_RD_DIS_BT_ERR : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_BT_ERR  (BIT(12))
#define EFUSE_RD_DIS_BT_ERR_M  (BIT(12))
#define EFUSE_RD_DIS_BT_ERR_V  0x1
#define EFUSE_RD_DIS_BT_ERR_S  12
/* EFUSE_RD_DIS_DOWNLOAD_DCACHE_ERR : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_DOWNLOAD_DCACHE_ERR  (BIT(11))
#define EFUSE_RD_DIS_DOWNLOAD_DCACHE_ERR_M  (BIT(11))
#define EFUSE_RD_DIS_DOWNLOAD_DCACHE_ERR_V  0x1
#define EFUSE_RD_DIS_DOWNLOAD_DCACHE_ERR_S  11
/* EFUSE_RD_DIS_DOWNLOAD_ICACHE_ERR : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_DOWNLOAD_ICACHE_ERR  (BIT(10))
#define EFUSE_RD_DIS_DOWNLOAD_ICACHE_ERR_M  (BIT(10))
#define EFUSE_RD_DIS_DOWNLOAD_ICACHE_ERR_V  0x1
#define EFUSE_RD_DIS_DOWNLOAD_ICACHE_ERR_S  10
/* EFUSE_RD_DIS_DCACHE_ERR : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_DCACHE_ERR  (BIT(9))
#define EFUSE_RD_DIS_DCACHE_ERR_M  (BIT(9))
#define EFUSE_RD_DIS_DCACHE_ERR_V  0x1
#define EFUSE_RD_DIS_DCACHE_ERR_S  9
/* EFUSE_RD_DIS_ICACHE_ERR : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_ICACHE_ERR  (BIT(8))
#define EFUSE_RD_DIS_ICACHE_ERR_M  (BIT(8))
#define EFUSE_RD_DIS_ICACHE_ERR_V  0x1
#define EFUSE_RD_DIS_ICACHE_ERR_S  8
/* EFUSE_RD_DIS_RTC_RAM_BOOT_ERR : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_RTC_RAM_BOOT_ERR  (BIT(7))
#define EFUSE_RD_DIS_RTC_RAM_BOOT_ERR_M  (BIT(7))
#define EFUSE_RD_DIS_RTC_RAM_BOOT_ERR_V  0x1
#define EFUSE_RD_DIS_RTC_RAM_BOOT_ERR_S  7
/* EFUSE_RD_RD_DIS_ERR : RO ;bitpos:[6:0] ;default: 7'h0 ; */
/*description: */
#define EFUSE_RD_RD_DIS_ERR  0x0000007F
#define EFUSE_RD_RD_DIS_ERR_M  ((EFUSE_RD_RD_DIS_ERR_V)<<(EFUSE_RD_RD_DIS_ERR_S))
#define EFUSE_RD_RD_DIS_ERR_V  0x7F
#define EFUSE_RD_RD_DIS_ERR_S  0

#define EFUSE_RD_REPEAT_ERR1_REG          (DR_REG_EFUSE_BASE + 0x180)
/* EFUSE_RD_KEY_PURPOSE_1_ERR : RO ;bitpos:[31:28] ;default: 4'b0 ; */
/*description: */
#define EFUSE_RD_KEY_PURPOSE_1_ERR  0x0000000F
#define EFUSE_RD_KEY_PURPOSE_1_ERR_M  ((EFUSE_RD_KEY_PURPOSE_1_ERR_V)<<(EFUSE_RD_KEY_PURPOSE_1_ERR_S))
#define EFUSE_RD_KEY_PURPOSE_1_ERR_V  0xF
#define EFUSE_RD_KEY_PURPOSE_1_ERR_S  28
/* EFUSE_RD_KEY_PURPOSE_0_ERR : RO ;bitpos:[27:24] ;default: 4'b0 ; */
/*description: */
#define EFUSE_RD_KEY_PURPOSE_0_ERR  0x0000000F
#define EFUSE_RD_KEY_PURPOSE_0_ERR_M  ((EFUSE_RD_KEY_PURPOSE_0_ERR_V)<<(EFUSE_RD_KEY_PURPOSE_0_ERR_S))
#define EFUSE_RD_KEY_PURPOSE_0_ERR_V  0xF
#define EFUSE_RD_KEY_PURPOSE_0_ERR_S  24
/* EFUSE_RD_SECURE_BOOT_KEY_REVOKE2_ERR : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE2_ERR  (BIT(23))
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE2_ERR_M  (BIT(23))
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE2_ERR_V  0x1
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE2_ERR_S  23
/* EFUSE_RD_SECURE_BOOT_KEY_REVOKE1_ERR : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE1_ERR  (BIT(22))
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE1_ERR_M  (BIT(22))
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE1_ERR_V  0x1
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE1_ERR_S  22
/* EFUSE_RD_SECURE_BOOT_KEY_REVOKE0_ERR : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE0_ERR  (BIT(21))
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE0_ERR_M  (BIT(21))
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE0_ERR_V  0x1
#define EFUSE_RD_SECURE_BOOT_KEY_REVOKE0_ERR_S  21
/* EFUSE_RD_SPI_BOOT_CRYPT_CNT_ERR : RO ;bitpos:[20:18] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_SPI_BOOT_CRYPT_CNT_ERR  0x00000007
#define EFUSE_RD_SPI_BOOT_CRYPT_CNT_ERR_M  ((EFUSE_RD_SPI_BOOT_CRYPT_CNT_ERR_V)<<(EFUSE_RD_SPI_BOOT_CRYPT_CNT_ERR_S))
#define EFUSE_RD_SPI_BOOT_CRYPT_CNT_ERR_V  0x7
#define EFUSE_RD_SPI_BOOT_CRYPT_CNT_ERR_S  18
/* EFUSE_RD_WDT_DELAY_SEL_ERR : RO ;bitpos:[17:16] ;default: 2'b0 ; */
/*description: */
#define EFUSE_RD_WDT_DELAY_SEL_ERR  0x00000003
#define EFUSE_RD_WDT_DELAY_SEL_ERR_M  ((EFUSE_RD_WDT_DELAY_SEL_ERR_V)<<(EFUSE_RD_WDT_DELAY_SEL_ERR_S))
#define EFUSE_RD_WDT_DELAY_SEL_ERR_V  0x3
#define EFUSE_RD_WDT_DELAY_SEL_ERR_S  16
/* EFUSE_RD_SDIO_DCAP_ERR : RO ;bitpos:[15:14] ;default: 2'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_DCAP_ERR  0x00000003
#define EFUSE_RD_SDIO_DCAP_ERR_M  ((EFUSE_RD_SDIO_DCAP_ERR_V)<<(EFUSE_RD_SDIO_DCAP_ERR_S))
#define EFUSE_RD_SDIO_DCAP_ERR_V  0x3
#define EFUSE_RD_SDIO_DCAP_ERR_S  14
/* EFUSE_RD_SDIO_INIT_ERR : RO ;bitpos:[13:12] ;default: 2'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_INIT_ERR  0x00000003
#define EFUSE_RD_SDIO_INIT_ERR_M  ((EFUSE_RD_SDIO_INIT_ERR_V)<<(EFUSE_RD_SDIO_INIT_ERR_S))
#define EFUSE_RD_SDIO_INIT_ERR_V  0x3
#define EFUSE_RD_SDIO_INIT_ERR_S  12
/* EFUSE_RD_SDIO_DCURLIM_ERR : RO ;bitpos:[11:9] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_DCURLIM_ERR  0x00000007
#define EFUSE_RD_SDIO_DCURLIM_ERR_M  ((EFUSE_RD_SDIO_DCURLIM_ERR_V)<<(EFUSE_RD_SDIO_DCURLIM_ERR_S))
#define EFUSE_RD_SDIO_DCURLIM_ERR_V  0x7
#define EFUSE_RD_SDIO_DCURLIM_ERR_S  9
/* EFUSE_RD_SDIO_ENCURLIM_ERR : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_ENCURLIM_ERR  (BIT(8))
#define EFUSE_RD_SDIO_ENCURLIM_ERR_M  (BIT(8))
#define EFUSE_RD_SDIO_ENCURLIM_ERR_V  0x1
#define EFUSE_RD_SDIO_ENCURLIM_ERR_S  8
/* EFUSE_RD_SDIO_EN_INIT_ERR : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_EN_INIT_ERR  (BIT(7))
#define EFUSE_RD_SDIO_EN_INIT_ERR_M  (BIT(7))
#define EFUSE_RD_SDIO_EN_INIT_ERR_V  0x1
#define EFUSE_RD_SDIO_EN_INIT_ERR_S  7
/* EFUSE_RD_SDIO_FORCE_ERR : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_FORCE_ERR  (BIT(6))
#define EFUSE_RD_SDIO_FORCE_ERR_M  (BIT(6))
#define EFUSE_RD_SDIO_FORCE_ERR_V  0x1
#define EFUSE_RD_SDIO_FORCE_ERR_S  6
/* EFUSE_RD_SDIO_TIEH_ERR : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_TIEH_ERR  (BIT(5))
#define EFUSE_RD_SDIO_TIEH_ERR_M  (BIT(5))
#define EFUSE_RD_SDIO_TIEH_ERR_V  0x1
#define EFUSE_RD_SDIO_TIEH_ERR_S  5
/* EFUSE_RD_SDIO_XPD_ERR : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_XPD_ERR  (BIT(4))
#define EFUSE_RD_SDIO_XPD_ERR_M  (BIT(4))
#define EFUSE_RD_SDIO_XPD_ERR_V  0x1
#define EFUSE_RD_SDIO_XPD_ERR_S  4
/* EFUSE_RD_SDIO_DREFL_ERR : RO ;bitpos:[3:2] ;default: 2'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_DREFL_ERR  0x00000003
#define EFUSE_RD_SDIO_DREFL_ERR_M  ((EFUSE_RD_SDIO_DREFL_ERR_V)<<(EFUSE_RD_SDIO_DREFL_ERR_S))
#define EFUSE_RD_SDIO_DREFL_ERR_V  0x3
#define EFUSE_RD_SDIO_DREFL_ERR_S  2
/* EFUSE_RD_SDIO_DREFM_ERR : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define EFUSE_RD_SDIO_DREFM_ERR  0x00000003
#define EFUSE_RD_SDIO_DREFM_ERR_M  ((EFUSE_RD_SDIO_DREFM_ERR_V)<<(EFUSE_RD_SDIO_DREFM_ERR_S))
#define EFUSE_RD_SDIO_DREFM_ERR_V  0x3
#define EFUSE_RD_SDIO_DREFM_ERR_S  0

#define EFUSE_RD_REPEAT_ERR2_REG          (DR_REG_EFUSE_BASE + 0x184)
/* EFUSE_RD_FLASH_TPUW_ERR : RO ;bitpos:[31:28] ;default: 4'b0 ; */
/*description: */
#define EFUSE_RD_FLASH_TPUW_ERR  0x0000000F
#define EFUSE_RD_FLASH_TPUW_ERR_M  ((EFUSE_RD_FLASH_TPUW_ERR_V)<<(EFUSE_RD_FLASH_TPUW_ERR_S))
#define EFUSE_RD_FLASH_TPUW_ERR_V  0xF
#define EFUSE_RD_FLASH_TPUW_ERR_S  28
/* EFUSE_RD_XTAL_FREQ_ERR : RO ;bitpos:[27:22] ;default: 6'b0 ; */
/*description: */
#define EFUSE_RD_XTAL_FREQ_ERR  0x0000003F
#define EFUSE_RD_XTAL_FREQ_ERR_M  ((EFUSE_RD_XTAL_FREQ_ERR_V)<<(EFUSE_RD_XTAL_FREQ_ERR_S))
#define EFUSE_RD_XTAL_FREQ_ERR_V  0x3F
#define EFUSE_RD_XTAL_FREQ_ERR_S  22
/* EFUSE_RD_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR  (BIT(21))
#define EFUSE_RD_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR_M  (BIT(21))
#define EFUSE_RD_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR_V  0x1
#define EFUSE_RD_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR_S  21
/* EFUSE_RD_SECURE_BOOT_EN_ERR : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SECURE_BOOT_EN_ERR  (BIT(20))
#define EFUSE_RD_SECURE_BOOT_EN_ERR_M  (BIT(20))
#define EFUSE_RD_SECURE_BOOT_EN_ERR_V  0x1
#define EFUSE_RD_SECURE_BOOT_EN_ERR_S  20
/* EFUSE_RD_KEY_PURPOSE_6_ERR : RO ;bitpos:[19:16] ;default: 4'b0 ; */
/*description: */
#define EFUSE_RD_KEY_PURPOSE_6_ERR  0x0000000F
#define EFUSE_RD_KEY_PURPOSE_6_ERR_M  ((EFUSE_RD_KEY_PURPOSE_6_ERR_V)<<(EFUSE_RD_KEY_PURPOSE_6_ERR_S))
#define EFUSE_RD_KEY_PURPOSE_6_ERR_V  0xF
#define EFUSE_RD_KEY_PURPOSE_6_ERR_S  16
/* EFUSE_RD_KEY_PURPOSE_5_ERR : RO ;bitpos:[15:12] ;default: 4'b0 ; */
/*description: */
#define EFUSE_RD_KEY_PURPOSE_5_ERR  0x0000000F
#define EFUSE_RD_KEY_PURPOSE_5_ERR_M  ((EFUSE_RD_KEY_PURPOSE_5_ERR_V)<<(EFUSE_RD_KEY_PURPOSE_5_ERR_S))
#define EFUSE_RD_KEY_PURPOSE_5_ERR_V  0xF
#define EFUSE_RD_KEY_PURPOSE_5_ERR_S  12
/* EFUSE_RD_KEY_PURPOSE_4_ERR : RO ;bitpos:[11:8] ;default: 4'b0 ; */
/*description: */
#define EFUSE_RD_KEY_PURPOSE_4_ERR  0x0000000F
#define EFUSE_RD_KEY_PURPOSE_4_ERR_M  ((EFUSE_RD_KEY_PURPOSE_4_ERR_V)<<(EFUSE_RD_KEY_PURPOSE_4_ERR_S))
#define EFUSE_RD_KEY_PURPOSE_4_ERR_V  0xF
#define EFUSE_RD_KEY_PURPOSE_4_ERR_S  8
/* EFUSE_RD_KEY_PURPOSE_3_ERR : RO ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: */
#define EFUSE_RD_KEY_PURPOSE_3_ERR  0x0000000F
#define EFUSE_RD_KEY_PURPOSE_3_ERR_M  ((EFUSE_RD_KEY_PURPOSE_3_ERR_V)<<(EFUSE_RD_KEY_PURPOSE_3_ERR_S))
#define EFUSE_RD_KEY_PURPOSE_3_ERR_V  0xF
#define EFUSE_RD_KEY_PURPOSE_3_ERR_S  4
/* EFUSE_RD_KEY_PURPOSE_2_ERR : RO ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: */
#define EFUSE_RD_KEY_PURPOSE_2_ERR  0x0000000F
#define EFUSE_RD_KEY_PURPOSE_2_ERR_M  ((EFUSE_RD_KEY_PURPOSE_2_ERR_V)<<(EFUSE_RD_KEY_PURPOSE_2_ERR_S))
#define EFUSE_RD_KEY_PURPOSE_2_ERR_V  0xF
#define EFUSE_RD_KEY_PURPOSE_2_ERR_S  0

