foxval/esp-idf/components/soc/esp32c/include/soc/efuse_reg.h
#define EFUSE_RD_REPEAT_ERR3_REG          (DR_REG_EFUSE_BASE + 0x188)
/* EFUSE_RD_RESERVE_ERR : RO ;bitpos:[31:8] ;default: 24'h0 ; */
/*description: */
#define EFUSE_RD_RESERVE_ERR  0x00FFFFFF
#define EFUSE_RD_RESERVE_ERR_M  ((EFUSE_RD_RESERVE_ERR_V)<<(EFUSE_RD_RESERVE_ERR_S))
#define EFUSE_RD_RESERVE_ERR_V  0xFFFFFF
#define EFUSE_RD_RESERVE_ERR_S  8
/* EFUSE_RD_UART_PRINT_CONTROL : RO ;bitpos:[7:6] ;default: 2'b0 ; */
/*description: */
#define EFUSE_RD_UART_PRINT_CONTROL  0x00000003
#define EFUSE_RD_UART_PRINT_CONTROL_M  ((EFUSE_RD_UART_PRINT_CONTROL_V)<<(EFUSE_RD_UART_PRINT_CONTROL_S))
#define EFUSE_RD_UART_PRINT_CONTROL_V  0x3
#define EFUSE_RD_UART_PRINT_CONTROL_S  6
/* EFUSE_RD_ENABLE_SECURITY_DOWNLOAD : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_ENABLE_SECURITY_DOWNLOAD  (BIT(5))
#define EFUSE_RD_ENABLE_SECURITY_DOWNLOAD_M  (BIT(5))
#define EFUSE_RD_ENABLE_SECURITY_DOWNLOAD_V  0x1
#define EFUSE_RD_ENABLE_SECURITY_DOWNLOAD_S  5
/* EFUSE_RD_DIS_USB_DOWNLOAD_MODE : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_USB_DOWNLOAD_MODE  (BIT(4))
#define EFUSE_RD_DIS_USB_DOWNLOAD_MODE_M  (BIT(4))
#define EFUSE_RD_DIS_USB_DOWNLOAD_MODE_V  0x1
#define EFUSE_RD_DIS_USB_DOWNLOAD_MODE_S  4
/* EFUSE_RD_DIS_TINY_BASIC : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_TINY_BASIC  (BIT(3))
#define EFUSE_RD_DIS_TINY_BASIC_M  (BIT(3))
#define EFUSE_RD_DIS_TINY_BASIC_V  0x1
#define EFUSE_RD_DIS_TINY_BASIC_S  3
/* EFUSE_RD_UART_PRINT_CHANNEL : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_UART_PRINT_CHANNEL  (BIT(2))
#define EFUSE_RD_UART_PRINT_CHANNEL_M  (BIT(2))
#define EFUSE_RD_UART_PRINT_CHANNEL_V  0x1
#define EFUSE_RD_UART_PRINT_CHANNEL_S  2
/* EFUSE_RD_DIS_LEGACY_SPI_BOOT_ERR : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_LEGACY_SPI_BOOT_ERR  (BIT(1))
#define EFUSE_RD_DIS_LEGACY_SPI_BOOT_ERR_M  (BIT(1))
#define EFUSE_RD_DIS_LEGACY_SPI_BOOT_ERR_V  0x1
#define EFUSE_RD_DIS_LEGACY_SPI_BOOT_ERR_S  1
/* EFUSE_RD_DIS_DOWNLOAD_MODE_ERR : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_DIS_DOWNLOAD_MODE_ERR  (BIT(0))
#define EFUSE_RD_DIS_DOWNLOAD_MODE_ERR_M  (BIT(0))
#define EFUSE_RD_DIS_DOWNLOAD_MODE_ERR_V  0x1
#define EFUSE_RD_DIS_DOWNLOAD_MODE_ERR_S  0

#define EFUSE_RD_REPEAT_ERR4_REG          (DR_REG_EFUSE_BASE + 0x190)
/* EFUSE_RD_CHIP_VERSION_ERR : RO ;bitpos:[23:0] ;default: 24'h0 ; */
/*description: */
#define EFUSE_RD_CHIP_VERSION_ERR  0x00FFFFFF
#define EFUSE_RD_CHIP_VERSION_ERR_M  ((EFUSE_RD_CHIP_VERSION_ERR_V)<<(EFUSE_RD_CHIP_VERSION_ERR_S))
#define EFUSE_RD_CHIP_VERSION_ERR_V  0xFFFFFF
#define EFUSE_RD_CHIP_VERSION_ERR_S  0

#define EFUSE_RD_RS_ERR0_REG          (DR_REG_EFUSE_BASE + 0x194)
/* EFUSE_RD_KEY4_FAIL : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_KEY4_FAIL  (BIT(31))
#define EFUSE_RD_KEY4_FAIL_M  (BIT(31))
#define EFUSE_RD_KEY4_FAIL_V  0x1
#define EFUSE_RD_KEY4_FAIL_S  31
/* EFUSE_RD_KEY4_ERR_NUM : RO ;bitpos:[30:28] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_KEY4_ERR_NUM  0x00000007
#define EFUSE_RD_KEY4_ERR_NUM_M  ((EFUSE_RD_KEY4_ERR_NUM_V)<<(EFUSE_RD_KEY4_ERR_NUM_S))
#define EFUSE_RD_KEY4_ERR_NUM_V  0x7
#define EFUSE_RD_KEY4_ERR_NUM_S  28
/* EFUSE_RD_KEY3_FAIL : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_KEY3_FAIL  (BIT(27))
#define EFUSE_RD_KEY3_FAIL_M  (BIT(27))
#define EFUSE_RD_KEY3_FAIL_V  0x1
#define EFUSE_RD_KEY3_FAIL_S  27
/* EFUSE_RD_KEY3_ERR_NUM : RO ;bitpos:[26:24] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_KEY3_ERR_NUM  0x00000007
#define EFUSE_RD_KEY3_ERR_NUM_M  ((EFUSE_RD_KEY3_ERR_NUM_V)<<(EFUSE_RD_KEY3_ERR_NUM_S))
#define EFUSE_RD_KEY3_ERR_NUM_V  0x7
#define EFUSE_RD_KEY3_ERR_NUM_S  24
/* EFUSE_RD_KEY2_FAIL : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_KEY2_FAIL  (BIT(23))
#define EFUSE_RD_KEY2_FAIL_M  (BIT(23))
#define EFUSE_RD_KEY2_FAIL_V  0x1
#define EFUSE_RD_KEY2_FAIL_S  23
/* EFUSE_RD_KEY2_ERR_NUM : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_KEY2_ERR_NUM  0x00000007
#define EFUSE_RD_KEY2_ERR_NUM_M  ((EFUSE_RD_KEY2_ERR_NUM_V)<<(EFUSE_RD_KEY2_ERR_NUM_S))
#define EFUSE_RD_KEY2_ERR_NUM_V  0x7
#define EFUSE_RD_KEY2_ERR_NUM_S  20
/* EFUSE_RD_KEY1_FAIL : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_KEY1_FAIL  (BIT(19))
#define EFUSE_RD_KEY1_FAIL_M  (BIT(19))
#define EFUSE_RD_KEY1_FAIL_V  0x1
#define EFUSE_RD_KEY1_FAIL_S  19
/* EFUSE_RD_KEY1_ERR_NUM : RO ;bitpos:[18:16] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_KEY1_ERR_NUM  0x00000007
#define EFUSE_RD_KEY1_ERR_NUM_M  ((EFUSE_RD_KEY1_ERR_NUM_V)<<(EFUSE_RD_KEY1_ERR_NUM_S))
#define EFUSE_RD_KEY1_ERR_NUM_V  0x7
#define EFUSE_RD_KEY1_ERR_NUM_S  16
/* EFUSE_RD_KEY0_FAIL : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_KEY0_FAIL  (BIT(15))
#define EFUSE_RD_KEY0_FAIL_M  (BIT(15))
#define EFUSE_RD_KEY0_FAIL_V  0x1
#define EFUSE_RD_KEY0_FAIL_S  15
/* EFUSE_RD_KEY0_ERR_NUM : RO ;bitpos:[14:12] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_KEY0_ERR_NUM  0x00000007
#define EFUSE_RD_KEY0_ERR_NUM_M  ((EFUSE_RD_KEY0_ERR_NUM_V)<<(EFUSE_RD_KEY0_ERR_NUM_S))
#define EFUSE_RD_KEY0_ERR_NUM_V  0x7
#define EFUSE_RD_KEY0_ERR_NUM_S  12
/* EFUSE_RD_USR_DATA_FAIL : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_USR_DATA_FAIL  (BIT(11))
#define EFUSE_RD_USR_DATA_FAIL_M  (BIT(11))
#define EFUSE_RD_USR_DATA_FAIL_V  0x1
#define EFUSE_RD_USR_DATA_FAIL_S  11
/* EFUSE_RD_USR_DATA_ERR_NUM : RO ;bitpos:[10:8] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_USR_DATA_ERR_NUM  0x00000007
#define EFUSE_RD_USR_DATA_ERR_NUM_M  ((EFUSE_RD_USR_DATA_ERR_NUM_V)<<(EFUSE_RD_USR_DATA_ERR_NUM_S))
#define EFUSE_RD_USR_DATA_ERR_NUM_V  0x7
#define EFUSE_RD_USR_DATA_ERR_NUM_S  8
/* EFUSE_RD_SYS_ERR_FAIL : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_SYS_ERR_FAIL  (BIT(7))
#define EFUSE_RD_SYS_ERR_FAIL_M  (BIT(7))
#define EFUSE_RD_SYS_ERR_FAIL_V  0x1
#define EFUSE_RD_SYS_ERR_FAIL_S  7
/* EFUSE_RD_SYS_ERR_NUM : RO ;bitpos:[6:4] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_SYS_ERR_NUM  0x00000007
#define EFUSE_RD_SYS_ERR_NUM_M  ((EFUSE_RD_SYS_ERR_NUM_V)<<(EFUSE_RD_SYS_ERR_NUM_S))
#define EFUSE_RD_SYS_ERR_NUM_V  0x7
#define EFUSE_RD_SYS_ERR_NUM_S  4
/* EFUSE_RD_MAC_SPI_8M_FAIL : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define EFUSE_RD_MAC_SPI_8M_FAIL  (BIT(3))
#define EFUSE_RD_MAC_SPI_8M_FAIL_M  (BIT(3))
#define EFUSE_RD_MAC_SPI_8M_FAIL_V  0x1
#define EFUSE_RD_MAC_SPI_8M_FAIL_S  3
/* EFUSE_RD_MAC_SPI_8M_ERR_NUM : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: */
#define EFUSE_RD_MAC_SPI_8M_ERR_NUM  0x00000007
#define EFUSE_RD_MAC_SPI_8M_ERR_NUM_M  ((EFUSE_RD_MAC_SPI_8M_ERR_NUM_V)<<(EFUSE_RD_MAC_SPI_8M_ERR_NUM_S))
#define EFUSE_RD_MAC_SPI_8M_ERR_NUM_V  0x7
#define EFUSE_RD_MAC_SPI_8M_ERR_NUM_S  0

